ArrowElectronicsESC/P64_Webinar/FreeRTOS_P64_Webinar/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/aws_demos/application_code/main.c
#ifdef CY_TFM_PSA_SUPPORTED
static struct ns_mailbox_queue_t ns_mailbox_queue;

static void tfm_ns_multi_core_boot(void)
{
    int32_t ret;

    printf("Non-secure code running on non-secure core.\r\n");

    if (tfm_ns_wait_for_s_cpu_ready()) {
        printf("Error sync'ing with secure core.\r\n");

        /* Avoid undefined behavior after multi-core sync-up failed */
        for (;;) {
        }
    }

    ret = tfm_ns_mailbox_init(&ns_mailbox_queue);
    if (ret != MAILBOX_SUCCESS) {
        printf("Non-secure mailbox initialization failed.\r\n");

        /* Avoid undefined behavior after NS mailbox initialization failed */
        for (;;) {
        }
    }
}
#endif

/*-----------------------------------------------------------*/

/*******************************************************************************/
void handle_error(void)
{
	printf("Error in main.c ");
     /* Disable all interrupts. */
    __disable_irq();

    CY_ASSERT(0);
}

/*******************************************************************************
* Function Name: gpio_interrupt_handler
********************************************************************************
* Summary:
*   GPIO interrupt handler.
*
* Parameters:
*  void *handler_arg (unused)
*  cyhal_gpio_irq_event_t (unused)
*
*******************************************************************************/
static void gpio_interrupt_handler(void *handler_arg, cyhal_gpio_irq_event_t event)
{
    gpio_intr_flag = 1;
}


/*******************************************************************************
* Function Name: Read Pressure Task
********************************************************************************
* Summary:
*   Init I2C
*   Init DPS368
*   Read Temperature
*   Read Pressure
*   Calucate Pressure
*   Check for Fall Eveent
*   Publish data
*
* Parameters:
*
*
*******************************************************************************/
void Read_Pressure( void * pvParameters )
{
	    cy_rslt_t result;
	    uint32_t pressure;
	    uint32_t temperature;
	    uint8_t  sensor_ready;
	    uint8_t  pressure_ready;
	    uint8_t  temperature_ready;
	    uint8_t	 wait_count;
	    uint8_t	 first_prs;
	    uint8_t	 publish_count;
	    float 	 temp_flt ;
	 	float 	 last_prs_flt;


	    /* The parameter value is expected to be 1 as 1 is passed in the
	    pvParameters value in the call to xTaskCreate() below. */
	    configASSERT( ( ( uint32_t ) pvParameters ) == 1 );

	    /* Initialize the Green LED - It will toggle everytime an MQTT message is sent */
	    cyhal_gpio_init(CYBSP_LED_RGB_GREEN, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, false);
	    cyhal_gpio_init(CYBSP_LED_RGB_RED, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, false);

	    /* \x1b[2J\x1b[;H - ANSI ESC sequence for clear screen */
	    printf("\x1b[2J\x1b[;H");

	    printf("****************************\r\n");
	    printf("PSoC6 MCU with DPS368 		 \r\n");
	    printf("Barometric Pressure Sensor   \r\n");
	    printf("****************************\r\n\n");

	    last_prs_flt = 0;
	    first_prs = 0;

	    /* Configure I2C Master */
	#if PRINT_DEBUG
	    printf(">> Configuring I2C master..... ");
	#endif

	    mI2C_cfg.is_slave = false;
	    mI2C_cfg.address = 0;
	    mI2C_cfg.frequencyhal_hz = I2C_FREQ;
	    result = cyhal_i2c_init( &mI2C, mI2C_SDA, mI2C_SCL, NULL);
	    if (result != CY_RSLT_SUCCESS)
	    {
	        handle_error();
	    }
	    result = cyhal_i2c_configure( &mI2C, &mI2C_cfg);
	    if (result != CY_RSLT_SUCCESS)
	    {
	        handle_error();
	    }
	#if PRINT_DEBUG
	    printf("Done\r\n");
	#endif

	    /* Enable interrupts */
	    __enable_irq();

	    fall_event = 0;
	    publish_count = 0;
	    cyhal_gpio_write( CYBSP_LED_RGB_GREEN, CYBSP_LED_STATE_OFF);
	    cyhal_gpio_write( CYBSP_LED_RGB_RED, CYBSP_LED_STATE_OFF);

	    printf("Init DPS368 \r\n");
	    DPS368_Init();

	    /* Check if sensor is ready and initialized */
	    sensor_ready = SENSOR_RDY & Get_DPS368_Sensor_Status();

	    while (!sensor_ready)
	    {
	    	sensor_ready = SENSOR_RDY & Get_DPS368_Sensor_Status();
	    }
	    printf("DPS368 Ready\r\n");

    for( ;; )
    {
   		cyhal_gpio_write( CYBSP_LED_RGB_RED, CYBSP_LED_STATE_OFF);
    	if(gpio_intr_flag)
    	{
    		gpio_intr_flag = 0;
    		printf("User Button 1 Depressed \r\n");
    		cyhal_gpio_write( CYBSP_LED_RGB_GREEN, CYBSP_LED_STATE_OFF);
    		fall_event = 0;
    	}
        /* Start by reading the Temperature - this is required for an accurate Pressure calculation. */
        Set_DPS368_Sensor_Operating_Mode(START_TEMPERATURE_MEASUREMENT);
        wait_count = 0;
        temperature_ready = TMP_RDY & Get_DPS368_Sensor_Status();
        while (!temperature_ready)
        {
        	cyhal_system_delay_ms(STATUS_REG_READ_DELAY_MS);
           	temperature_ready = (TMP_RDY & Get_DPS368_Sensor_Status());
            wait_count++;
           	if (wait_count > 100)
           	{
           		 printf("Temp Ready Timeout \r\n");
           		 Set_DPS368_Sensor_Operating_Mode(START_TEMPERATURE_MEASUREMENT);
           		 wait_count = 0;
           	}
           	cyhal_system_delay_ms(STATUS_REG_READ_DELAY_MS);
        }
        temperature = Get_DPS368_Temperature();

        Set_DPS368_Sensor_Operating_Mode(STANDBY);
        cyhal_system_delay_ms(STATUS_REG_READ_DELAY_MS);
        temp_flt = Calculate_Temperature(temperature);


        /* Get pressure by starting a pressure measurement and tesing the status bit for ready.
         * Timeout after not ready for 100ms */

        Set_DPS368_Sensor_Operating_Mode(START_PRESSURE_MEASUREMENT);

        pressure_ready = PRS_RDY & Get_DPS368_Sensor_Status();
        wait_count = 0;
        while (!pressure_ready)
        {
           	cyhal_system_delay_ms(STATUS_REG_READ_DELAY_MS);
           	pressure_ready = (PRS_RDY & Get_DPS368_Sensor_Status());
           	wait_count++;
           	if (wait_count > 100)
           	{
           		Set_DPS368_Sensor_Operating_Mode(STANDBY);
           		cyhal_system_delay_ms(STATUS_REG_READ_DELAY_MS);
           		Set_DPS368_Sensor_Operating_Mode(START_PRESSURE_MEASUREMENT);
           		wait_count = 0;
           	}
        }

        /* Once the status is ready, read the raw pressure and calculate the real pressure in Pa */
        pressure = Get_DPS368_Pressure();

       	prs_flt = Calculate_Pressure(pressure);

       	/* This is a delta pressure calc. Print after 2nd pressure read */
       	if (first_prs)
       	{
       		printf("Pressure %4.1f Pa \tDelta P %4.1f Pa \tTemp =  %4.1f F \r\n", prs_flt, prs_flt- last_prs_flt, ((temp_flt *9/5) +32));

       		/* If there is a change of more that +3 Pa, that indicates a fall event */
       		if (prs_flt- last_prs_flt > 3)
       		{
       			/* Set Fall event flag and publish fall event flag, turn on LED and print message to debug port*/
       			fall_event = 1;
       			publish_fall_event = 1;
       			publish_count = 0;
       			cyhal_gpio_write( CYBSP_LED_RGB_GREEN, CYBSP_LED_STATE_ON);
       			printf("Fall Event \r\n");
       		}

